app/Services/AdminService.php

    public function getAdminById($username)
    {
        return $this->admins->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'quanly'
 LIMIT 1