app/Services/DasService.php

  public function getTotals (){
    $totalDishes = $this->dishesModel->countAllResults();
    $totalRemark = $this->remarkModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `dishes`
SELECT COUNT(*) AS `numrows`
FROM `remark`