app/Services/ResService.php

SELECT `c_id`
FROM `restaurant`
SELECT *
FROM `restaurant`
SELECT `c_name`
FROM `res_category`
WHERE `c_id` IN ('6','6','7','7','8','8')
---
    public function getListRestaurant(){

        $idCategory = $this->RestaurantModel->select('c_id')->findAll();
        $idTableArray = array_column($idCategory, 'c_id');
        $resCategory = $this->ResCateModel->select('c_name')->whereIn('c_id', $idTableArray)->findAll(); // Sử dụng whereIn
        return [
            'resCategory' => $resCategory,
            'listRes' => $this->RestaurantModel->findAll()
        ];